Ran Plan for dir: `accounts/animeutopia-prod` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/usr/local/bin/terraform plan -input=false -refresh -out "/home/atlantis/.atlantis/repos/ryan-longoria/FeedUtopia/34/default/accounts/animeutopia-prod/animeutopia-prod-default.tfplan" -var-file=tfvars/prod-ue2-animeutopia.tfvars -var-file=/home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars' in '/home/atlantis/.atlantis/repos/ryan-longoria/FeedUtopia/34/default/accounts/animeutopia-prod': exit status 1
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.
Wrote /home/atlantis/.atlantis/nonprod-ue2-multiaccounts.tfvars with secrets from SSM.

aws_iam_role.eventbridge_role: Refreshing state... [id=eventbridge_step_functions_role]
aws_iam_role.step_functions_role: Refreshing state... [id=anime_step_functions_role]
aws_s3_bucket.media_bucket: Refreshing state... [id=prod-animeutopia-media-bucket]
aws_iam_policy.s3_full_policy: Refreshing state... [id=arn:aws:iam::481665084477:policy/anime_s3_full_policy]
aws_iam_role.lambda_role: Refreshing state... [id=anime_lambda_role]
aws_cloudwatch_event_rule.workflow_schedule: Refreshing state... [id=anime_workflow_schedule]
aws_s3_bucket_versioning.media_bucket_versioning: Refreshing state... [id=prod-animeutopia-media-bucket]
aws_lambda_function.fetch_rss: Refreshing state... [id=fetch_rss]
aws_lambda_function.process_content: Refreshing state... [id=process_content]
aws_lambda_function.render_video: Refreshing state... [id=render_video]
aws_lambda_function.store_data: Refreshing state... [id=store_data]
aws_lambda_function.notify_post: Refreshing state... [id=notify_post]
aws_iam_role_policy_attachment.lambda_basic_execution: Refreshing state... [id=anime_lambda_role-20250311151731272200000002]
aws_iam_role_policy_attachment.attach_s3_full_policy: Refreshing state... [id=anime_lambda_role-20250311151731257600000001]
aws_sfn_state_machine.anime_workflow: Refreshing state... [id=arn:aws:states:us-east-2:481665084477:stateMachine:anime_workflow]
aws_iam_role_policy.step_functions_policy: Refreshing state... [id=anime_step_functions_role:anime_step_functions_policy]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_iam_policy.s3_full_policy has been deleted
  - resource "aws_iam_policy" "s3_full_policy" {
      - arn              = "arn:aws:iam::481665084477:policy/anime_s3_full_policy" -> null
        id               = "arn:aws:iam::481665084477:policy/anime_s3_full_policy"
        name             = "anime_s3_full_policy"
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # aws_iam_role.lambda_role has been deleted
  - resource "aws_iam_role" "lambda_role" {
      - arn                   = "arn:aws:iam::481665084477:role/anime_lambda_role" -> null
        id                    = "anime_lambda_role"
      - name                  = "anime_lambda_role" -> null
        tags                  = {}
        # (11 unchanged attributes hidden)
    }

  # aws_iam_role.step_functions_role has been deleted
  - resource "aws_iam_role" "step_functions_role" {
      - id                    = "anime_step_functions_role" -> null
        name                  = "anime_step_functions_role"
        tags                  = {}
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_lambda_function.fetch_rss has been deleted
  - resource "aws_lambda_function" "fetch_rss" {
      - arn                            = "arn:aws:lambda:us-east-2:481665084477:function:fetch_rss" -> null
        id                             = "fetch_rss"
        tags                           = {}
        # (28 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.notify_post has been deleted
  - resource "aws_lambda_function" "notify_post" {
      - arn                            = "arn:aws:lambda:us-east-2:481665084477:function:notify_post" -> null
        id                             = "notify_post"
        tags                           = {}
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.process_content has been deleted
  - resource "aws_lambda_function" "process_content" {
      - arn                            = "arn:aws:lambda:us-east-2:481665084477:function:process_content" -> null
        id                             = "process_content"
        tags                           = {}
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.render_video has been deleted
  - resource "aws_lambda_function" "render_video" {
      - arn                            = "arn:aws:lambda:us-east-2:481665084477:function:render_video" -> null
        id                             = "render_video"
        tags                           = {}
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.store_data has been deleted
  - resource "aws_lambda_function" "store_data" {
      - arn                            = "arn:aws:lambda:us-east-2:481665084477:function:store_data" -> null
        id                             = "store_data"
        tags                           = {}
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_cloudwatch_event_rule.workflow_schedule will be created
  + resource "aws_cloudwatch_event_rule" "workflow_schedule" {
      + arn                 = (known after apply)
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "anime_workflow_schedule"
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(5 minutes)"
      + tags_all            = (known after apply)
    }

  # aws_iam_policy.s3_full_policy will be created
  + resource "aws_iam_policy" "s3_full_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy to allow Lambda full access to S3"
      + id               = (known after apply)
      + name             = "anime_s3_full_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:*"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::prod-animeutopia-media-bucket",
                          + "arn:aws:s3:::prod-animeutopia-media-bucket/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_role.eventbridge_role will be created
  + resource "aws_iam_role" "eventbridge_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "events.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eventbridge_step_functions_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.lambda_role will be created
  + resource "aws_iam_role" "lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "anime_lambda_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.step_functions_role will be created
  + resource "aws_iam_role" "step_functions_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "anime_step_functions_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy.step_functions_policy will be created
  + resource "aws_iam_role_policy" "step_functions_policy" {
      + id          = (known after apply)
      + name        = "anime_step_functions_policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_iam_role_policy_attachment.attach_s3_full_policy will be created
  + resource "aws_iam_role_policy_attachment" "attach_s3_full_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "anime_lambda_role"
    }

  # aws_iam_role_policy_attachment.lambda_basic_execution will be created
  + resource "aws_iam_role_policy_attachment" "lambda_basic_execution" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "anime_lambda_role"
    }

  # aws_lambda_function.fetch_rss will be created
  + resource "aws_lambda_function" "fetch_rss" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./artifacts/scripts/fetch_rss/fetch_rss.zip"
      + function_name                  = "fetch_rss"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "xTAS3Ntxo89+oBY6o1wDCgU43Jy3ZsG7frf/Ks1ITkc="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 10
      + version                        = (known after apply)

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_lambda_function.notify_post will be created
  + resource "aws_lambda_function" "notify_post" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./artifacts/scripts/notify_post/notify_post.zip"
      + function_name                  = "notify_post"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "eKcU66F2PCAju7EJsqol/ynecXqErCcuknzzaakDnwo="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "TARGET_BUCKET"     = "prod-animeutopia-media-bucket"
              + "TEAMS_WEBHOOK_URL" = "https://feedutopia.webhook.office.com/webhookb2/0ec044b6-d4fe-42b4-98f4-ca8a9b2e491e@c76f234b-5cdf-49b5-b968-9d0517a5c694/IncomingWebhook/15df2c60c45142c7ba181f8f344e4998/2742a55c-9d93-47f0-aed1-1965283926c0/V2Cnzgq7uVfRrUuBqjjg-PFkjf5_B3LNar_rdf3HmjIWk1"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_lambda_function.process_content will be created
  + resource "aws_lambda_function" "process_content" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./artifacts/scripts/process_content/process_content.zip"
      + function_name                  = "process_content"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-east-2:481665084477:layer:imagick-layer:1",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "CqGCdQ5IOUobfheTOORB6x2weZ8B7bfmOjeqq8XKZl0="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "IMAGE_MAGICK_EXE" = "/bin/magick"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_lambda_function.render_video will be created
  + resource "aws_lambda_function" "render_video" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "render_video"
      + id                             = (known after apply)
      + image_uri                      = "481665084477.dkr.ecr.us-east-2.amazonaws.com/render_video_repository@sha256:62d0bd0bc8a36c68201ec227e08739523cf6fff83bf57f15954f9e49120fb658"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 3008
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "FFMPEG_PATH"   = "/opt/bin/ffmpeg"
              + "TARGET_BUCKET" = "prod-animeutopia-media-bucket"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_lambda_function.store_data will be created
  + resource "aws_lambda_function" "store_data" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./artifacts/scripts/store_data/store_data.zip"
      + function_name                  = "store_data"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "xbFSeoIoi8FEdK9TKvtCnYv8tSTzQh3azQ0/0Y+gcH4="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "BUCKET_NAME" = "prod-animeutopia-media-bucket"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_s3_bucket.media_bucket will be created
  + resource "aws_s3_bucket" "media_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "prod-animeutopia-media-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

Plan: 14 to add, 0 to change, 0 to destroy.
╷
│ Error: reading S3 Bucket Versioning (prod-animeutopia-media-bucket): operation error S3: GetBucketVersioning, https response error StatusCode: 403, RequestID: H1ZC9A6X2T6Z044G, HostID: XHxLynASun9il75rs7rW1VD6xxYqs0ji9LIHoZPv3DnBPYejFsV9H3oiKmG0DGI2uledyAeg+abB+mmXFuta+DoIbJ++pcKB, api error AccessDenied: Access Denied
│ 
│   with aws_s3_bucket_versioning.media_bucket_versioning,
│   on s3.tf line 11, in resource "aws_s3_bucket_versioning" "media_bucket_versioning":
│   11: resource "aws_s3_bucket_versioning" "media_bucket_versioning" {
│ 
╵
╷
│ Error: reading Step Functions State Machine (arn:aws:states:us-east-2:481665084477:stateMachine:anime_workflow): operation error SFN: DescribeStateMachine, https response error StatusCode: 400, RequestID: 5fa8afe2-dd89-4a02-a589-1036799c0ea3, api error AccessDeniedException: User: arn:aws:sts::851725522400:assumed-role/Atlantis-EC2-Role/i-01f4df6528d781d4c is not authorized to access this resource
│ 
│   with aws_sfn_state_machine.anime_workflow,
│   on sfn.tf line 5, in resource "aws_sfn_state_machine" "anime_workflow":
│    5: resource "aws_sfn_state_machine" "anime_workflow" {
│ 
╵


```
</details>